# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\code\cypress\controllers\dcsd.cydsn\dcsd.cyprj
# Date: Sun, 18 Sep 2016 03:47:20 GMT
#set_units -time ns
create_clock -name {Cyclk12(FFB)} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {pwmClk(FFB)} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/ff_div_9}]]
create_clock -name {ADC_intClock(FFB)} -period 208.33333333333331 -waveform {0 104.166666666667} [list [get_pins {ClockBlock/ff_div_7}]]
create_clock -name {UART_SCBCLK(FFB)} -period 729.16666666666663 -waveform {0 364.583333333333} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {Cyclk12} -source [get_pins {ClockBlock/hfclk}] -edges {1 5 9} [list]
create_generated_clock -name {qdecClk} -source [get_pins {ClockBlock/hfclk}] -edges {1 57 111} -nominal_period 1166.6666666666665 [list [get_pins {ClockBlock/udb_div_0}]]
create_generated_clock -name {pwmClk} -source [get_pins {ClockBlock/hfclk}] -edges {1 2 3} [list]
create_generated_clock -name {ADC_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 11 21} -nominal_period 208.33333333333331 [list]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 35 71} [list]


# Component constraints for D:\code\cypress\controllers\dcsd.cydsn\TopDesign\TopDesign.cysch
# Project: D:\code\cypress\controllers\dcsd.cydsn\dcsd.cyprj
# Date: Sun, 18 Sep 2016 03:47:16 GMT
